import store from '../store'

export default class Secret {
    constructor() {
        this.loveTougne = ""
        this.secrets = [
            '你不喜欢猫猫狗狗,我很喜欢,你经常说,跟你在一起以后,我这辈子都不会有自己的宠物了,但是我不后悔,因为..........有你就够啦💗',
            '最喜欢你的一点,不管吵架,不开心,闹矛盾,从来不会失联,再生气也会主动联系我,谢谢那么久以来的包容😊',
            '都说程序猿不懂浪漫,我想,或许这就是程序猿的浪漫吧...🌸',
            '明明不擅长算术,还要坚持做算术相关的工作,如果说这个项目是程序猿最后的倔强，那你的职业选择估计也是你最后的倔强了吧,不管是好是坏,努力过就好啦,加油吧,皮丘🍉',
            `我们已经相爱${this.getKnowTime()}天啦!要一直幸福下去噢💗`,
            this.getMarryTime() > 0 ? `还有${this.getMarryTime()}天,我们就要结婚啦!要让所有人见证我们的幸福呀💗` : `我们已经结婚啦!要一直幸福下去,直到永远噢🌸`,
            '虽然我很怂,一直都怂.....最大胆的一次,就是想让全世界都看到我对你的告白🎁',
            '你最喜欢的数字是369,发个动态都要等分针指向369才发,有的时候觉得很傻,有时候又觉得特别可爱🍄',
            '第一次去迪士尼的时候,你戴着仙女发箍,我们拍了很多很多照片,当时我在想,如果这就是是现实中的城堡,那你一定就是我的公主了吧👰',
            '每次有好吃的都会第一时间想到我,用你的话说就是,就算是狗屎也会带给我一起分享😭',
            '吃东西每次都要先拍照,喜欢贵的,又喜欢好看的,对食物的追求永远停留在表面,最后偏偏选了我这个又没钱又没颜值的,还说从不后悔...😆',
            '后来我才发现,做这个东西最难的地方不是写代码,而是....究竟要怎么样才能想出那么多土味情话...😆',
            '第一次见我妈妈的时候,你穿着刚买的不合脚的高跟鞋,躲在我身后很怂的样子真的太可爱了...😊',
            '记得我们去扬州的时候明明天气很冷,你穿了个长裙冻得瑟瑟发抖,问你冷不冷还说....不冷,那次我们吃了好多好吃的,还放了风筝🌸',
            '第一次去爬山,完全没有运动能力的我走两步就要休息一下...估计你当时肯定贼嫌弃了,结果下山的时候,被路人辅助第一次牵了你的手,然后一牵就牵到了现在..',
            '自从认识你之后,好像就没怎么打过游戏(除了你送我的任天堂😊),刚开始是假装上进,久而久之好像就成了习惯...也没那么喜欢打游戏了',
            `自从100天之后,我们好像很久没正儿八经过过什么纪念日了,时间也变得更快了,一转眼我们就在一起${this.getKnowTime()}天啦,我不是什么仪式感特别强的男生,甚至有点直男,谢谢你对我的包容,让我们有了更多美好的回忆🌸`,
            this.getPaperTime() > 0 ? `我们莫名其妙约定了9.6去领证,哈哈哈,感觉不错,还有${this.getPaperTime()}天我们就合法啦!🌈` : `我们莫名其妙约定了9.6去领证,哈哈哈,感觉不错,现在我们已经合法啦!🌈`,
            `“你变得越来越不像你了”
            ------“像我老公” 这是你对我说的第一句情话😆`,
            `听到我生病马上要做手术的时候,二话不说就请假来上海看我,结果还买不到车票买了贼贵的商务座...😆还好最后康复了,不然真的太对不起你啦`,
            `真怀念二十四小时土豆啊😁`,
            `在南京的深夜食堂吃到了人生中最好吃的寿喜锅🍣`,
            `第一次见到你哭是在新区的胡桃里,当时就发誓以后一定要保护好眼前的这个姑娘,印象深刻当时背景音乐是lala land的主题曲,希望我们的梦想也能最终实现`,
            `第一次陪你去买Victoria's Secret,害羞的我完全不敢进去啊,在星巴克等了半天>.<,最后还是进去了😆`,

        ]
        this.badMemory = [
            `我们第一次去吃的那家蛋糕店,老板很nice的多送了好多好吃的,时间过得好快,好想再回去那家店吃一次,可惜已经关门啦😭$$cake.jpg`,
            `陪你度过了第一个新年,未来还会有好多好多个吧🌸$$newYear.jpg`
        ]
        this.blue = [
            '还记得那次在停车场哭,以后不想再发生了😪',
            '去韩国的时候,明明说要带我去牛岛玩,结果.......还是在屡次不开心之后在我的带领下来到了牛岛🐂',
            `帮你买了很多没有卵用的东西>.<,你也帮我买了很多没有卵用的东西,要是我们能节俭一点,说不定现在可以富裕一点啦😆`,
            '还记得刚开始的时候大部分时候都可以在苏州陪着你,度过了我们人生中很快乐的一段时间,好景不长,很快就异地了,分开的时候偶尔会想念对方,但更多的是对未来美好的期待..🍦',
            '真的很对不起你,让你为了我一次又一次和家人矛盾😪',
            '一直都想不通两个审美,兴趣,追求都完全不同的两个人,究竟怎么就这样走到了最后...😁',
            '其实有时候我也会觉得我们现在这样不错,周末见面,彼此有更多的精力趁着年轻的时候努力奋斗💪',
        ]
    }

    bind(object, func) {
        return function () {
            return func.apply(object, arguments);
        }
    }

    speak(id, i = 0) {
        let str = '';
        if (id === 0) {
            str = `所以..............................你愿意嫁给我吗？👰                 我不管,我先说啦                ---------  “yes ,I do🌸”`
        }
        else if (id > 0 && id <= 10) {
            str = this.badMemory[id % this.badMemory.length];
        }
        else if (id > 10 && id <= 20) {
            str = this.blue[id % this.blue.length];
        }
        else {
            str = this.secrets[id % this.secrets.length];
        }
        var img;
        [str, img] = str.split('$$');
        if (i <= str.length) {
            store.dispatch('setSecret', str.slice(0, i++) + '_')
            const timer = setTimeout(this.bind(this, this.speak), Math.random() * 400, id, i)
            store.dispatch('setTimer', timer)
        } else {
            if (img) {
                store.dispatch('setImg', require(`@/assets/${img}`))
            }
            store.dispatch('setSecret', str)
        }
    }

    getKnowTime() {
        var start = new Date(2018, 1, 26);
        var end = new Date();
        var delta = end.getTime() - start.getTime();
        return Math.floor(delta / (24 * 3600 * 1000)) + 30
    }

    getMarryTime() {
        var marry = new Date(2019, 11, 24);
        var start = new Date();
        var delta = marry.getTime() - start.getTime();
        return Math.ceil(delta / (24 * 3600 * 1000)) - 30
    }

    getPaperTime() {
        var paper = new Date(2019, 9, 6);
        var start = new Date();
        var delta = paper.getTime() - start.getTime();
        return Math.ceil(delta / (24 * 3600 * 1000)) - 30
    }
}
